Show / Hide Table of Contents
Class ProjectDataEc
Additional data for Ec project
Inheritance
System.Object
OpenObject
ProjectDataEc
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.ProjectData.ProjectDataEc,CI.ProjectData")]
public class ProjectDataEc : OpenObject
Properties
Improve this Doc   View Source
AnnexCode
Gets or sets the actual national annex
Declaration
public NationalAnnexCode AnnexCode { get; set; }
Property Value
 Type |  Description
 NationalAnnexCode
Improve this Doc   View Source
FatigueAnnexNN
True for check fatigue accorting 1992-2 Annex NN
Declaration
public bool FatigueAnnexNN { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
FatigueCheck
To allow fatigue check
Declaration
public bool FatigueCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source